In [1]:
import pandas as pd  #pan: panel, da: data, s: series

In [2]:
df = pd.read_csv("C:/Users/vamsh/Downloads/Salaries.csv", sep=",")
df

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0             1      Prof          B             19           18  Male  139750
1             2      Prof          B             20           16  Male  173200
2             3  AsstProf          B              4            3  Male   79750
3             4      Prof          B             45           39  Male  115000
4             5      Prof          B             40           41  Male  141500
..          ...       ...        ...            ...          ...   ...     ...
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

[397 rows x 7 columns]

# Initial Data Inspection

In [3]:
df.head(10) #displays 10 starting records

,Unnamed: 0,rank,discipline,yrs.since.phd,yrs.service,sex,salary
0,1,Prof,B,19,18,Male,139750
1,2,Prof,B,20,16,Male,173200
2,3,AsstProf,B,4,3,Male,79750
3,4,Prof,B,45,39,Male,115000
4,5,Prof,B,40,41,Male,141500
5,6,AssocProf,B,6,6,Male,97000
6,7,Prof,B,30,23,Male,175000
7,8,Prof,B,45,45,Male,147765
8,9,Prof,B,21,20,Male,119250
9,10,Prof,B,18,18,Female,129000

In [4]:
df.tail(10) #displays 10 end records

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
387         388      Prof          A             29           15  Male  109305
388         389      Prof          A             38           36  Male  119450
389         390      Prof          A             33           18  Male  186023
390         391      Prof          A             40           19  Male  166605
391         392      Prof          A             30           19  Male  151292
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [5]:
df.shape

(397, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     397 non-null    int64
 1   rank           397 non-null    object
 2   discipline     397 non-null    object
 3   yrs.since.phd  397 non-null    int64
 4   yrs.service    397 non-null    int64
 5   sex            397 non-null    object
 6   salary         397 non-null    int64
dtypes: int64(4), object(3)
memory usage: 21.8+ KB

In [7]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [8]:
df.describe(include="all")

,Unnamed: 0,rank,discipline,yrs.since.phd,yrs.service,sex,salary
count,397.000000,397,397,397.000000,397.000000,397,397.000000
unique,NaN,3,2,NaN,NaN,2,NaN
top,NaN,Prof,B,NaN,NaN,Male,NaN
freq,NaN,266,216,NaN,NaN,358,NaN
mean,199.000000,NaN,NaN,22.314861,17.614610,NaN,113706.458438
std,114.748275,NaN,NaN,12.887003,13.006024,NaN,30289.038695
min,1.000000,NaN,NaN,1.000000,0.000000,NaN,57800.000000
25%,100.000000,NaN,NaN,12.000000,7.000000,NaN,91000.000000
50%,199.000000,NaN,NaN,21.000000,16.000000,NaN,107300.000000
75%,298.000000,NaN,NaN,32.000000,27.000000,NaN,134185.000000
max,397.000000,NaN,NaN,56.000000,60.000000,NaN,231545.000000

In [9]:
# Filtering the cloumns

In [10]:
# retrieve by name
# 1. By . operator
# 2. By [''] operator

In [13]:
df.salary

0      139750
1      173200
2       79750
3      115000
4      141500
        ...
392    103106
393    150564
394    101738
395     95329
396     81035
Name: salary, Length: 397, dtype: int64

In [14]:
df['salary']

0      139750
1      173200
2       79750
3      115000
4      141500
        ...
392    103106
393    150564
394    101738
395     95329
396     81035
Name: salary, Length: 397, dtype: int64

In [16]:
df[['salary']]  #single [] makes it as a list,  double [[]] makes it as a dataframe

     salary
0    139750
1    173200
2     79750
3    115000
4    141500
..      ...
392  103106
393  150564
394  101738
395   95329
396   81035

[397 rows x 1 columns]

In [18]:
df[['salary','sex','rank']]

     salary   sex      rank
0    139750  Male      Prof
1    173200  Male      Prof
2     79750  Male  AsstProf
3    115000  Male      Prof
4    141500  Male      Prof
..      ...   ...       ...
392  103106  Male      Prof
393  150564  Male      Prof
394  101738  Male      Prof
395   95329  Male      Prof
396   81035  Male  AsstProf

[397 rows x 3 columns]

In [19]:
df.index

RangeIndex(start=0, stop=397, step=1)

In [23]:
df.iloc[3]

Unnamed: 0            4
rank               Prof
discipline            B
yrs.since.phd        45
yrs.service          39
sex                Male
salary           115000
Name: 3, dtype: object

In [24]:
df.iloc[3,4]

39

In [25]:
df.iloc[3,4:7]

yrs.service        39
sex              Male
salary         115000
Name: 3, dtype: object

In [31]:
df.iloc[:,4:7]

     yrs.service   sex  salary
0             18  Male  139750
1             16  Male  173200
2              3  Male   79750
3             39  Male  115000
4             41  Male  141500
..           ...   ...     ...
392           30  Male  103106
393           19  Male  150564
394           25  Male  101738
395           15  Male   95329
396            4  Male   81035

[397 rows x 3 columns]

In [34]:
df.iloc[:,[1,4]]

         rank  yrs.service
0        Prof           18
1        Prof           16
2    AsstProf            3
3        Prof           39
4        Prof           41
..        ...          ...
392      Prof           30
393      Prof           19
394      Prof           25
395      Prof           15
396  AsstProf            4

[397 rows x 2 columns]

In [36]:
df.iloc[[10,100,150,200],[1,4,5]]

          rank  yrs.service   sex
10   AssocProf            8  Male
100       Prof           25  Male
150       Prof           12  Male
200   AsstProf            4  Male

# Condition based filtering

In [41]:
df['salary'] > 200000

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393    False
394    False
395    False
396    False
Name: salary, Length: 397, dtype: bool

In [42]:
df[df['salary'] > 200000]

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
43           44  Prof          B             38           38  Male  231545
249         250  Prof          A             29            7  Male  204000
364         365  Prof          A             43           43  Male  205500

In [47]:
(df['salary'] > 200000) & (df['rank'] == "Prof")  #Multiple Conditions

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393    False
394    False
395    False
396    False
Length: 397, dtype: bool

In [51]:
df[(df['salary'] > 200000) & ((df['yrs.since.phd'] > 30) | (df['discipline'] == "A"))]

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
43           44  Prof          B             38           38  Male  231545
249         250  Prof          A             29            7  Male  204000
364         365  Prof          A             43           43  Male  205500

# Adding and Deleting of columns

In [52]:
df.columns

Index(['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service',
       'sex', 'salary'],
      dtype='object')

In [53]:
#delete the 'Unnamed: 0' Column
del df['Unnamed: 0']

In [54]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      Prof          B             19           18  Male  139750
1      Prof          B             20           16  Male  173200
2  AsstProf          B              4            3  Male   79750
3      Prof          B             45           39  Male  115000
4      Prof          B             40           41  Male  141500

In [55]:
df.shape

(397, 6)

In [61]:
df.drop("salary",axis = 1)

         rank discipline  yrs.since.phd  yrs.service   sex
0        Prof          B             19           18  Male
1        Prof          B             20           16  Male
2    AsstProf          B              4            3  Male
3        Prof          B             45           39  Male
4        Prof          B             40           41  Male
..        ...        ...            ...          ...   ...
392      Prof          A             33           30  Male
393      Prof          A             31           19  Male
394      Prof          A             42           25  Male
395      Prof          A             25           15  Male
396  AsstProf          A              8            4  Male

[397 rows x 5 columns]

In [63]:
df.shape # drop dont really delete a column, it just deletes from the view unless we update the df

(397, 6)

In [64]:
# df = df.drop("salary",axis = 1)
v1 = df.drop("salary",axis = 1)
v1

         rank discipline  yrs.since.phd  yrs.service   sex
0        Prof          B             19           18  Male
1        Prof          B             20           16  Male
2    AsstProf          B              4            3  Male
3        Prof          B             45           39  Male
4        Prof          B             40           41  Male
..        ...        ...            ...          ...   ...
392      Prof          A             33           30  Male
393      Prof          A             31           19  Male
394      Prof          A             42           25  Male
395      Prof          A             25           15  Male
396  AsstProf          A              8            4  Male

[397 rows x 5 columns]

In [65]:
v1.shape

(397, 5)

In [68]:
df['A'] = range(0,len(df))

In [69]:
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary    A
0        Prof          B             19           18  Male  139750    0
1        Prof          B             20           16  Male  173200    1
2    AsstProf          B              4            3  Male   79750    2
3        Prof          B             45           39  Male  115000    3
4        Prof          B             40           41  Male  141500    4
..        ...        ...            ...          ...   ...     ...  ...
392      Prof          A             33           30  Male  103106  392
393      Prof          A             31           19  Male  150564  393
394      Prof          A             42           25  Male  101738  394
395      Prof          A             25           15  Male   95329  395
396  AsstProf          A              8            4  Male   81035  396

[397 rows x 7 columns]

In [70]:
df['B'] = range(0,len(df),2) # Step value = 2
# Above will throw an error as this will not fill the entire rows

ValueError: Length of values (199) does not match length of index (397)

In [71]:
df['A'] = range(0,2*len(df), 2)

In [72]:
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary    A
0        Prof          B             19           18  Male  139750    0
1        Prof          B             20           16  Male  173200    2
2    AsstProf          B              4            3  Male   79750    4
3        Prof          B             45           39  Male  115000    6
4        Prof          B             40           41  Male  141500    8
..        ...        ...            ...          ...   ...     ...  ...
392      Prof          A             33           30  Male  103106  784
393      Prof          A             31           19  Male  150564  786
394      Prof          A             42           25  Male  101738  788
395      Prof          A             25           15  Male   95329  790
396  AsstProf          A              8            4  Male   81035  792

[397 rows x 7 columns]

In [79]:
df['salary'].mean(), df['salary'].median() 
#mean() is the average (always by value) 
#median is always by the position(sort and cancel from both ends)
#median always give two halfs(exact center)
# when there is a huge diff betwn mean and median, it is advised to with median as it is based on position....

(113706.45843828715, 107300.0)

In [74]:
df['salary'].sum()

45141464

In [80]:
df['salary'].std()  #standard deviation

30289.038694747804

In [ ]:
#standard deviation can be gone till the maximum of "3", almost 99.6% of the records be in this standard deviation
# the remaining 0.4% are outliers
# Quantile : 4 parts ( by 3 cuts :Q1(left), Q2(mean), Q3(right))

In [81]:
df['salary'].quantile(0.5) # same as mean Q2

107300.0

In [82]:
df['salary'].quantile(0.25) #left cut

91000.0

In [83]:
df['salary'].quantile(0.75) #right cut

134185.0

In [84]:
df.describe()

       yrs.since.phd  yrs.service         salary          A
count     397.000000   397.000000     397.000000  397.00000
mean       22.314861    17.614610  113706.458438  396.00000
std        12.887003    13.006024   30289.038695  229.49655
min         1.000000     0.000000   57800.000000    0.00000
25%        12.000000     7.000000   91000.000000  198.00000
50%        21.000000    16.000000  107300.000000  396.00000
75%        32.000000    27.000000  134185.000000  594.00000
max        56.000000    60.000000  231545.000000  792.00000

In [86]:
# method for identifying to find that if the data is continuous or discrete
df['salary'].value_counts()

salary
92000     5
72500     4
74000     4
105000    3
101000    3
         ..
76840     1
83001     1
113278    1
155500    1
81035     1
Name: count, Length: 371, dtype: int64

In [1]:
# If the list is longer, it is continuous else discrete